// Problem-01: New Price for Eid Sale
// ⚠️ Function Name Must be newPrice()
// আসন্ন ইদ উপলক্ষে তুমি তোমার দোকানের প্রোডাক্টে ডিসকাউণ্ট দিতে চাচ্ছ। কিন্তু প্রতিটা প্রোডাক্টের নতুন দাম আলাদা আলাদা হিসাব করতে গেলে ঝামেলা। তাই তুমি একটা ফাংশন বানাতে চাও, যা মূল দাম এবং ডিসকাউন্ট% নিলে নতুন দাম বের করে দেবে।

// Input :  
// প্রথম ইনপুট:  একটি সংখ্যা যা মূল দাম। currentPrice  হবে Number 
// দ্বিতীয় ইনপুট: একটি সংখ্যা যা ডিসকাউন্ট। discount হবে Number in  %




// Output :   ফাংশনটি ডিসকাউন্ট করে নতুন দাম (Number) return করবে।  Output দশমিক সংখ্যা ও হতে পারে।  দশমিক এর পর ৩ ঘর  দেখাতে হবে।

 
// Challenge 📢 : যদি কোনো ইনপুট সংখ্যা না হয় , অথবা discount এর পরিমান যদি 0  এর থেকে কম এবং 100 এর চেয়ে বেশি হয় তাহলে  Invalid স্ট্রিং  রিটার্ন করবে। 



// Hints 💡:  যদি একটি প্রোডাক্টের currentPrice = 1500 টাকা এবং discount = 20% হয়, তাহলে:
// ডিসকাউন্টের পরিমাণ বের করো, ডিসকাউন্ট পরিমাণ = (1500 * 20) / 100 = 300 টাকা



/*function signature/sample */
//Problem-01: New Price for Eid Sale
function newPrice(currentPrice, discount) {

    if (typeof currentPrice !== 'number' || typeof discount !== 'number') {
        return "Invalid";
    }

    if (discount < 0 || discount > 100) {
        return "Invalid";
    }

    let discountAmount = (currentPrice * discount) / 100;
    let finalPrice = currentPrice - discountAmount;

    return finalPrice.toFixed(3);
}
let Price = newPrice('22', 11);
console.log(Price); // 196.000


// ⚠️ Function Name Must be validOtp()

// Zapshift কোম্পানি তাদের প্রোডাক্ট ডেলিভারি করার সময় OTP পাঠায়। কিন্তু কিছু লোক Fraud OTP ব্যবহার করে প্রোডাক্ট রিসিভ করে ফেলে। তাই তোমার কাজ হলো একটি ফাংশন বানানো, যা OTP সঠিক কিনা চেক করবে।

// ফাংশনটি একটি Boolean (true/false) রিটার্ন করবে। যদি ইনপুটটি সঠিক ফরম্যাটে না থাকে তবে Invalid রিটার্ন করবে।

// 📥 Input:
// একটি ইনপুট: otp : string
// 🚀 Output:
// Boolean (true / false) রিটার্ন করবে
// 🚩 Challenge:
// যদি

// ইনপুট string না হয় (যেমন: Number, Array, Object, null ইত্যাদি)
// তাহলে "Invalid" রিটার্ন করতে হবে।
// 🎯 Validation Rules:
// OTP অবশ্যই ৮ অক্ষরের হতে হবে (length === 8)
// OTP অবশ্যই "ph-" দিয়ে শুরু হতে হবে
// 💡 Hints:
// startsWith() মেথড ব্যবহার করতে পারো।


// Test Cases
// Example 1
// Input:
// validOtp("ph-10985")
// Expected Output:
// true
// Example 2
// Input:
// validOtp("ph-1234")
// Expected Output:
// false
// Example 3
// Input:
// validOtp("abc-12345")
// Expected Output:
// false



/*function signature/sample */
// Problem-02: OTP Validation for Zapshift
function validOtp(otp) {
    if (typeof otp !== 'string') {
        return "Invalid";
    }

    if (otp.length === 8 && otp.startsWith("ph-")) {
        return true;
    } else {
        return false;
    }   
}






// ⚠️ Function Name Must be finalScore()

// BCS পরীক্ষার OMR sheet ডিজিটালভাবে চেক করা হয়। এটা right, wrong, missed সব কটি গণনা করতে পারে, কিন্তু ফাইনাল স্কোর বের করতে পারে না। তোমার কাজ হলো একটি ফাংশন বানানো যা Object নেবে এবং ফাইনাল স্কোর ক্যালকুলেট করবে।

// ফাংশনের কাজ: ফাংশনটি ইনপুট হিসেবে একটি Object নেবে এবং নিচের শর্ত ও নিয়ম অনুযায়ী ফলাফল প্রদান করবে।

// 📥 Input:
// একটি Object যার প্রপার্টিগুলো হবে:

// {
//   right: Number,
//   wrong: Number,
//   skip: Number
// }
// 🚀 Output:
// সঠিক হলে → Number (রাউন্ডেড ফাইনাল স্কোর)
// 🎯 BCS পরীক্ষার নিয়ম:
// মোট প্রশ্ন: ১০০টি
// সুতরাং, ইনপুটে থাকা right + wrong + skip এর যোগফল অবশ্যই ১০০ হতে হবে
// 🚩 Challenge:
// যদি

// right + wrong + skip এর যোগফল ১০০ না হয়
// তাহলে "Invalid" রিটার্ন করতে হবে।
// 🎯 Scoring Rules:
// প্রতিটি সঠিক উত্তরের জন্য: +১ পয়েন্ট।
// প্রতিটি ভুল উত্তরের জন্য: -০.৫ পয়েন্ট (০.৫ নম্বর কাটা যাবে)।
// বাদ দেওয়া(skip) প্রশ্নের জন্য: ০ পয়েন্ট।
// 💡 Hints:
// Rounded ভ্যালু বের করার জন্য Math.round() ব্যবহার করতে পারো।

//Problem-03: BCS Final Score Calculator

function finalScore (omr) {
    const { right, wrong, skip } = omr;

    if (right + wrong + skip !== 100) {
        return "Invalid";
    }

    const score = right * 1 - wrong * 0.5 + skip * 0;

    return Math.round(score);   
}


